import Cocoa
//1. Описать несоклько структур - любой легковой автомобиль и любой грузовик
//2. Структуры должны содеражть марку авто, год выпоска, объем багажника/кузова, состояние запущен ли двигатель, открыты ил окна? заполненный объем багажника.
//3. Описать перечисление с возможными действиями с автомобилем - запустить/заглушить двигатель, открыть/закрыть окна, погрузить/выгрузить из кузова/багажника груз определенного объема.
//4. Добавить в структуры метод с одним аргументом типа перечисления, который будет менять свойства структуры в зависимости от действия.
//5. Инициализировать несколько экземпляров структур. Применить к ним различные действия.
//6. Вывести значения свойств экземпляров в консоль.
var str = "Hello, playground"
